package lesson31.exercise04;

/*
Условие задачи:
Попробуйте скачать 4 файла одинаковой длины за кратчайшее время. Для этого можете использовать тот же URL, но дать
разные имено чтобы ваша файловая система не конфликтовала. А в главном потоке можете запустить секундомер через тот же
Timer например. По завершению скачивания отлогируйте в консоль время.

Попробуйте увеличить количество потоков до максимума пока время остается тем же самым. Проверьте экспериментально на
сколько потоков тянет ваш компьютер. Можете в список положить потоки и выполнить их сразу все в цикле.
 */

public class Solution {
}
