package lesson29.exercise03;

/*
Имитируем игру. Звенья цепи будут уровни. Игра типа квест. У каждого звена/уровня будет свой вопрос или несколько
вопросов с какими-то верными ответами или же любой ответ будет допустим, но из списка предложенных. Все ответы нужно
хранить в каком-то классе, можно в списке/массиве. Самое интересное будет то, что следующая цепочка будет проверять
повторно ответ предыдущей цепи и исходя из этого задавать нужный вопрос. Как в сценарии. Каждый уровень зависит от
итога предыдущего и сценарий будет свой.

Для примера - уровень первый. Вы оказались на перепутье, на камне надпись "налево пойдешь смерть найдешь, направо
пойдешь - ногу потеряешь, прямо пойдешь - мудрость найдешь". И нужно выбрать направление. Если выбрали налево, то там
какой-то сценарий типа - вы встретили торговца, у него есть товары типа такой и такой, ваши действия и так далее. Важно
чтобы на ждом шагу была вероятность выбрать смертельный исход, если не смертельный то идем по сценарию на следующий
уровень.
 */

public class Solution {
}
