package lesson29.exercise09;

/*
Написать класс который принимает аргументом список чисел. добавить ему методы на нахождение минимума и максимума, метод
сортировки по возрастанию и убыванию. Имейте ввиду что поле класса не должно меняться. Т.е. результат всех методов
новый список.

Так же добавьте метод который находит в списке элемент и еще один который отдаст новый список состоящий из элементов
больше переданного аргумента. Еще один метод на сумму всех членов списка. И еще один метод который заменит все нули
в списке на Integer.MAX_VALUE.
 */

public class Solution {
}
