package lesson23.exercise01;

/*
Напишите фабрику разработчиков. У вас должен быть абстрактный работник с зарплатой и опытом и 3 уровня работников -
Junior, Middle, Senior реализации. Написать фабрику в которой определить по опыту или зарплате какой нужно предоставить
объект работника. А еще можно сделать метод который принимает аргументом какое-то количество технологий которые должны
знать раблотники и в зависимости от количества выбираетя уровень работника
 */

public class Solution {
// объявить константы через enum? "public enum ... {...}"
}
