package lesson29.exercise07;

/*
Написать имитатор разносчика кофе. Добавить ему 3 наблюдателя. Когда он предлагает купить кофе все наблюдатели смотрят
в свой кошелек и в зависимости от этого покупают или не покупают кофе. Назначить цену для кофе и добавить работнику
3 наблюдателя с разным кешем в кармане. Через разные рандомные промежутки времени предлагать кофе (от 2 секунд до 7).
Каждому человеку хранить счетчик выпитых кофе, даже если у тебя много денег, то больше 2 раз пне пить кофе. Кофе пьется
5 секунд. Пока оно пьется человек не может заказать еще один кофе.
 */

public class Solution {
}
